laporankp/app/Controllers/Dashboard.php

SELECT *
FROM `kriteria`
SELECT *
FROM `indikator`
WHERE `id_kriteria` = '1'
SELECT COUNT(*) AS `numrows`
FROM `penilaian`
SELECT COUNT(*) AS `numrows`
FROM `indikator`
SELECT `penilaian`.`nilai`
FROM `indikator`
LEFT JOIN `penilaian` ON `penilaian`.`id_indikator` = `indikator`.`id_indikator`
WHERE `indikator`.`id_kriteria` = '1'
---
    public function index()
{
    // Cek apakah sudah login
    if (!session()->get('logged_in')) {
        return redirect()->to(base_url('login'));
    }

    $db = \Config\Database::connect();

    $kriteria = $db
        ->table('kriteria')
        ->get()
        ->getResult();

    foreach($kriteria as $k)
    {
        $k->indikator = $db->table('indikator')
            ->where('id_kriteria', $k->id_kriteria)
            ->get()
            ->getResult();
    }
    $sudahDiisi = $db->table('penilaian')->countAllResults();

    $totalIndikator = $db->table('indikator')->countAllResults();
    $belumDiisi = $totalIndikator - $sudahDiisi;

    $totalNilaiAkreditasi = 0;

    foreach ($kriteria as $k) {

        $hasil = $db->table('indikator')
            ->select('penilaian.nilai')
            ->join(
                'penilaian',
                'penilaian.id_indikator = indikator.id_indikator',
                'left'
            )
            ->where('indikator.id_kriteria', $k->id_kriteria)
            ->get()
            ->getResultArray();