laporankp/app/Controllers/FormInput.php

SELECT *
FROM `indikator`
WHERE `id_kriteria` = '1'
SELECT *
FROM `penilaian`
WHERE `id_indikator` = '1'
ORDER BY `id_penilaian` DESC
 LIMIT 1
---
    public function kriteria($id_kriteria)
    {
        $indikatorModel = new \App\Models\IndikatorModel();
        $penilaianModel = new \App\Models\PenilaianModel();

        $indikator = $indikatorModel
            ->where('id_kriteria', $id_kriteria)
            ->findAll();

        foreach ($indikator as &$i) {
            $penilaian = $penilaianModel
                ->where('id_indikator', $i['id_indikator'])
                ->orderBy('id_penilaian', 'DESC')
                ->first();

SELECT *
FROM `kriteria`
WHERE `kriteria`.`id_kriteria` = '1'
SELECT `indikator`.*, `penilaian`.`id_penilaian`, `penilaian`.`status`, `penilaian`.`nilai`, `penilaian`.`catatan`, `penilaian`.`file_bukti`, `penilaian`.`created_at`
FROM `indikator`
LEFT JOIN `penilaian` ON `penilaian`.`id_indikator` = `indikator`.`id_indikator`
WHERE `indikator`.`id_kriteria` = '1'
ORDER BY `indikator`.`id_indikator` ASC
---
    public function hasilPenilaian($id_kriteria)
    {
        $kriteriaModel = new \App\Models\KriteriaModel();
        $indikatorModel = new \App\Models\IndikatorModel();

        $data['kriteria'] = $kriteriaModel->find($id_kriteria);

        if (!$data['kriteria']) {
            throw \CodeIgniter\Exceptions\PageNotFoundException::forPageNotFound("Kriteria tidak ditemukan");
        }

        $data['hasil'] = $indikatorModel->db->table('indikator')
            ->select('indikator.*, penilaian.id_penilaian, penilaian.status, penilaian.nilai, penilaian.catatan, penilaian.file_bukti, penilaian.created_at')
            ->join('penilaian', 'penilaian.id_indikator = indikator.id_indikator', 'left')
            ->where('indikator.id_kriteria', $id_kriteria)
            ->orderBy('indikator.id_indikator', 'ASC')
            ->get()
            ->getResultArray();